Strömungssimulation/elbow3D/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    elbow
    {
        type triSurfaceMesh;
        file "elbow_auto.stl";
        regions
        {
            elbow_inlet  { name inlet; }
            outlet { name outlet; }
	    elbow_wall { name elbowWall; }
            injector_inlet  { name injectorInlet; }
	    injector_wall { name injectorWall; }
        }
    }

    refinementBox
    {
        type searchableBox;
        min (32 -8 -9);
        max (64 64  9);
    }
    
    cylinder
    {
	    type searchableCylinder;
	    point1 (54.63 -8 0);
	    point2 (54.63 36 0);
	    radius 4;
    }
};

castellatedMeshControls
{
    features
    (
      { file "elbow_auto.eMesh"; level 2; }
    );

    refinementSurfaces
    {
        elbow
        {
            level (1 2);
            patchInfo { type wall; }

            regions
            {
                inlet
                {
                    level (0 1);
                    patchInfo
                    {
                        type patch;
                        inGroups (inlet);
                    }
                }

                injectorInlet
                {
                    level (0 1);
                    patchInfo
                    {
                        type patch;
                        inGroups (inlet);
                    }
                }

                outlet
                {
                    level (0 1);
                    patchInfo
                    {
                        type patch;
                        inGroups (outlet);
                    }
                }
            }
        }
    }

    refinementRegions
    {
        cylinder
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    insidePoint (16.13 3.0001 0.43); // Offset from (0 0 0) to avoid
                                     // coinciding with face or edge
    nCellsBetweenLevels 2;
}

snapControls
{
//  explicitFeatureSnap    true;
//  implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        ".*Wall*"
        {
            nSurfaceLayers 7;
        }
    }

    relativeSizes       false; // true, usually with finalLayerThickness
    expansionRatio      1.3;
//    finalLayerThickness 0.7;
    minThickness        0.02;
    firstLayerThickness 0.05;

    featureAngle              270;
//  maxThicknessToMedialRatio 0.6;
}

writeFlags
(
//    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
