Strömungssimulation/elbow3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    elbowWall
    {
        type            kLowReWallFunction;
	value		uniform 0;
    }
    injectorWall
    {
        type            kLowReWallFunction;
	value		uniform 0;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
	intensity	0.02;
	value		uniform 0.03;
    }
    injectorInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
	intensity	0.05;
	value		uniform 0.625;
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
