Strömungssimulation/elbow3D/0/nSurfaceLayers
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nSurfaceLayers;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    elbowWall
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
19055
(
0
0
0
0
0
0
0
0
...
)
;
    }
    injectorInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    injectorWall
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
1129
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
