Strömungssimulation/elbow3D/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points  
(
 	(54 -4 0)
	(54 4  0)
	(54 12 0)
	(59 30 0)
	(8  8  0)
	(61 52 0)
);

fields 
(
	U
	p
);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
